Hi @adambarreiro, I have a strange behavior using the resource "vcd_ui_plugin", this is my code:
```
import {
  for_each = local.dr_plugin != null ? toset(["0"]) : [] # only if plugin is found, count cannot be used

  to = vcd_ui_plugin.dr_plugin[0]
  id = local.dr_plugin_id
}

# publish dr plugin
resource "vcd_ui_plugin" "dr_plugin" {
  count = local.dr_plugin != null ? 1 : 0 # only if plugin is found

  enabled    = true
  tenant_ids = local.dr_org_ids
}
```

the apply has been done at least once, so I have the resource in my state file (import is done during the first apply)
```
$ terraform state show 'vcd_ui_plugin.dr_plugin[0]'
# vcd_ui_plugin.dr_plugin[0]:
resource "vcd_ui_plugin" "dr_plugin" {
    description     = "VMware Cloud Director Availability™"
    enabled         = true
    id              = "urn:vcloud:uiPlugin:ec0f1e89-..."
    license         = "Copyright (C) VMware 2018-2020. All rights reserved."
    link            = "https://vcda:443"
    name            = "VCDA"
    provider_scoped = true
    status          = "ready"
    tenant_ids      = [
        "urn:vcloud:org:AAAAAAAA-...56",
        "urn:vcloud:org:AAAAAAAA-...66",
        "urn:vcloud:org:AAAAAAAA-...78",
        "urn:vcloud:org:AAAAAAAA-...60",
        "urn:vcloud:org:AAAAAAAA-...c1",
        "urn:vcloud:org:AAAAAAAA-...ec",
    ]
    tenant_scoped   = true
    vendor          = "VMware"
    version         = "4.7.1"
}
```

If I try a following plan, I got this message:

```
  # vcd_ui_plugin.dr_plugin[0] will be created
  + resource "vcd_ui_plugin" "dr_plugin" {
      + description     = (known after apply)
      + enabled         = true
      + id              = (known after apply)
      + license         = (known after apply)
      + link            = (known after apply)
      + name            = (known after apply)
      + provider_scoped = (known after apply)
      + status          = (known after apply)
      + tenant_ids      = [
          + "urn:vcloud:org:AAAAAAAA-...56",
          + "urn:vcloud:org:AAAAAAAA-...66",
          + "urn:vcloud:org:AAAAAAAA-...78",
          + "urn:vcloud:org:AAAAAAAA-...60",
          + "urn:vcloud:org:AAAAAAAA-...c1",
          + "urn:vcloud:org:AAAAAAAA-...ec",
        ]
      + tenant_scoped   = (known after apply)
      + vendor          = (known after apply)
      + version         = (known after apply)
    }
```
In this example the tenant_ids is unchanged (this plugin is already publish to this tenant) but if I have a change in ids I got the same issue.
If I proceed with apply I will get an error:
```
Error: could not create the UI Plugin: plugin path must not be empty with vcd_ui_plugin.dr_plugin[0]
```
And if I do apply again it works.
At the moment I do not run the apply, just to keep this situation.
Do I make something wrong?
Is it a terraform issue?
